# Поликарп обожает шифры. Недавно он изобрёл свой собственный, который назвал повторным.
#
# Повторный шифр используется для шифрования строк. Чтобы зашифровать строку s=s1s2…sm (1≤m≤10).
# Поликарп выполняет следующие шаги:
#
# он выписывает s1 один раз,
# он выписывает s2 два раза,
# он выписывает s3 три раза,
# ...
# он выписывает sm m раз.
# Например, если s="bab", то процесс шифрования будет выглядеть так: "b" → "baa" → "baabbb". Таким образом,
# для s="bab" результат шифрования равен "baabbb".
#
# Дана строка t — результат шифрования некоторой строки s. Ваша задача расшифровать, то есть найти строку s.
#
# Входные данные
# В первой строке записано целое число n (1≤n≤55) — длина зашифрованной строки. Вторая строка содержит t — результат
# шифрования некоторой строки s. Заданная строка содержит только строчные буквы латинского алфавита, длина t равна n.
#
# Гарантируется, что ответ на тест существует.
#
# Выходные данные
# Выведите такую строку s, которая после шифрования равна t.

def get_result(n, s):
    decode = ''
    index = 0
    count = 1
    while index < n:
        decode += s[index]
        count += 1
        index += count
    return decode


def main():
    print(get_result(int(input()), input()))


if __name__ == '__main__':
    main()
