# Сегодня Мезо решил сыграть в игру. Зома, главный герой в этой игре, изначально находится в позиции x=0.
# Мезо посылает n команд Зоме. Возможны два типа команд:
#
# 'L' (Влево) устанавливает позицию x:=x−1;
# 'R' (Вправо) устанавливает позицию x:=x+1.
# К сожалению, контроллер Мезо иногда не срабатывает. Некоторые команды отправляются успешно, а некоторые нет.
# Если команда не отправлена, то позиция x не меняется, и Мезо просто переходит к следующей команде.
#
# Например, если Мезо отправляет команды «LRLR», тогда возможны следующие исходы (подчеркнутые команды отправлены успешно):
#
# «LRLR» — Зома перемещается влево, вправо, опять влево и наконец вправо, заканчивая в позиции 0;
# «LRLR» — ни одна команда не отправлена, поэтому Зома никуда не двигается и заканчивает снова в позиции 0;
# «LRLR» — Зома перемещается влево, затем опять влево и заканчивает в позиции −2.
# Мезо не знает заранее, какие команды будут отправлены успешно. Поэтому он хочет узнать, сколько существует
# различных позиций таких, что Зома может закончить в них.
#
# Входные данные
# В первой строке записано одно целое число n (1≤n≤105) — количество команд, посылаемых Мезо.
#
# Во второй строке записана строка s из n команд, каждая либо 'L' (Влево), либо 'R' (Вправо).

def main():
    n = int(input())
    s = input()
    print(n + 1)



if __name__ == '__main__':
    main()
