# Задача №3626. Сумма с корнями
# По данным натуральным числам n и a вычислите сумму
#
# a+2a+...+(n−1)a+na−−√−−−−−−−−−−−−−√−−−−−−−−−−−−−−−−−−−−−√−−−−−−−−−−−−−−−−−−−−−−−−−−√
#
# Входные данные
# Вводятся два натуральных числа.
#
# Выходные данные
# Выведите ответ на задачу.

from math import sqrt


def sum_sqrt(n: int, a: int):
    r = 0
    for i in range(n, 0, -1):
        r = sqrt(i*a + r)
    return r


def main():
    print(sum_sqrt(int(input()), int(input())))


if __name__ == '__main__':
    main()
