/******************************************************************************

Задача №3530. Ряд - 3
Дано натуральное число n. Напечатайте все n-значные нечетные натуральные 
числа в порядке убывания.

Входные данные
Вводится натуральное число.

Выходные данные
Выведите ответ на задачу.

*******************************************************************************/
#include <iostream>
#include <math.h>

using namespace std;

int main()
{
    unsigned int row;
    cin >> row;
    int min = pow(10, row-1);
    int max = min * 10 - 1;
    
    for (int d = max; d >= min; d -= 2) {
        cout << d << ' ';
    }

    return 0;
}