# Задача №112174. Линия
# Напишите программу, которая строит "линию" из знаков '-' заданной длины. Используйте процедуру.
#
# Входные данные
# Входная строка содержит единственное натуральное число – длину линии N .
#
# Выходные данные
# Программа должна вывести N знаков '-'.


def main():
    print('-'*int(input()))


if __name__ == '__main__':
    main()
